cases/heatsink_flow/system/blockMeshDict
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      blockMeshDict;
}

scale   1;

// Simple rectangular channel
// Bottom wall is heated (heatsink surface at 80°C)

vertices
(
    (0 0 0)                              // 0
    (0.12 0 0)               // 1
    (0.12 0.04 0) // 2
    (0 0.04 0)               // 3
    (0 0 0.06)                // 4
    (0.12 0 0.06) // 5
    (0.12 0.04 0.06) // 6
    (0 0.04 0.06) // 7
);

blocks
(
    hex (0 1 2 3 4 5 6 7) (60 20 30)
    simpleGrading (
        1  // x: uniform
        (
            (0.3 0.3 4)   // near bottom wall - finer
            (0.4 0.4 1)   // middle
            (0.3 0.3 0.25) // near top wall - finer
        )
        1  // z: uniform
    )
);

edges ();

boundary
(
    inlet
    {
        type patch;
        faces
        (
            (0 4 7 3)
        );
    }

    outlet
    {
        type patch;
        faces
        (
            (1 2 6 5)
        );
    }

    topWall
    {
        type wall;
        faces
        (
            (3 7 6 2)
        );
    }

    heatedWall
    {
        type wall;
        faces
        (
            (0 1 5 4)
        );
    }

    front
    {
        type symmetry;
        faces
        (
            (0 3 2 1)
        );
    }

    back
    {
        type symmetry;
        faces
        (
            (4 5 6 7)
        );
    }
);

mergePatchPairs ();
