cases/heatsink_flow/constant/transportProperties
FoamFile
{
    version     2.0;
    format      ascii;
    class       dictionary;
    object      transportProperties;
}

// Air at ~50°C
transportModel  Newtonian;

nu              [0 2 -1 0 0 0 0] 1.6e-05;

// Thermal diffusivity for passive scalar transport
DT              [0 2 -1 0 0 0 0] 2.2535211267605634e-05;
